       IDENTIFICATION DIVISION.
       PROGRAM-ID. Hello.

       PROCEDURE DIVISION.
           DISPLAY "Hello World!".

       STOP RUN.
       END PROGRAM Hello.
